microservice/tsung.xml
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE tsung SYSTEM "/usr/local/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd" []>
<tsung loglevel="debug">

    <clients>
        <client host="localhost" cpu="4" maxusers="10000000"/>
    </clients>

    <servers>
        <server host="localhost" port="8000" type="tcp"/>
    </servers>

    <load>
        <arrivalphase phase="1" duration="1" unit="minute">
            <users arrivalrate="10" unit="second"/>
        </arrivalphase>
        <arrivalphase phase="2" duration="2" unit="minute">
            <users arrivalrate="25" unit="second"/>
        </arrivalphase>
    </load>

    <sessions>
        <session name="get_balance" weight="1" type="ts_http">
            <request>
                <http url="/get_deal_status?id=123" method="GET" />
            </request>
            <request>
                <http url="/get_balance?address=0xC82d0554D5ee7AC2e2eb1FBE0400De426DD2CFC5" method="GET" />
            </request>
            <request>
                <http url="/create_wallet" method="POST" />
            </request>
            <!-- <request>
                <http url="/create_wallet" method="POST" contents="address=0xC82d0554D5ee7AC2e2eb1FBE0400De426DD2CFC5&amp;amount=0.02&amp;id=123&amp;asset=ETHUSD&amp;trend=1&amp;payment_rate=10&amp;created_at=1509460540&amp;finished_at=1509460600" />
            </request> -->
        </session>
    </sessions>

</tsung>